fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Специалисты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Специалисты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Специалисты</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Специалисты</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ВКМ_СделатьДвижения();
КонецПроцедуры
#КонецОбласти  
  
#Область СлужебныеПроцедурыИФункции
Процедура ВКМ_СделатьДвижения() 
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина; 
	ТекущаяДата = ТекущаяДатаСеанса();

	Для Каждого ТекСтр Из Сотрудники Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентЗаказов;
        Движение.ПериодДействияНачало = Дата;
        Движение.ПериодДействияКонец = Дата;
        Движение.Сотрудник = ТекСтр.Сотрудник;
        Движение.Сумма = ТекСтр.СуммаПремии;  
		Движение.Регистратор = Ссылка; 
		Движение.ПериодРегистрации = ТекущаяДата;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);        
	
        Движение = Движения.ВКМ_Удержания.Добавить();
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
        Движение.ПериодДействияНачало = НачалоМесяца(Дата);
        Движение.ПериодДействияКонец = КонецМесяца(Дата);
        Движение.Сотрудник = ТекСтр.Сотрудник;
        Движение.Сумма = ТекСтр.СуммаПремии * 0.13;
		Движение.Регистратор = Ссылка;
		Движение.ПериодРегистрации = ТекущаяДата;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата); 
		
        ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
        ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
        ДвижениеВзаиморасчеты.Период = Дата;
        ДвижениеВзаиморасчеты.Сотрудник = ТекСтр.Сотрудник;
        ДвижениеВзаиморасчеты.Сумма = ТекСтр.СуммаПремии - Движение.Сумма; 
		ДвижениеВзаиморасчеты.Регистратор = Ссылка;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
